#############################################
# Brewfile                                  #
# Install homebrew packages                 #
# Maintainer: Drew Nall <drewnall@gmail.com #
# Last Updated: July 27, 2015               #
#############################################

# Usage:
# See http://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
# To use the Brewfile, tap hombrew/bundle to install the command,
# then run it in a directory containing a brewfile.
# 
# > brew tap homebrew/bundle
# > brew bundle
#
# Or use the brewfile.sh wrapper


# Tap some repos
tap "caskroom/cask"
tap "hombrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/dupes"
tap "homebrew/core"
tap "homebrew/head-only"
tap "homebrew/versions"
tap "homebrew/command-not-found"

# Install some brew-related stuff
brew "brew-cask"
brew "brew-cask-completion"
brew "brew-desc"

# Install shells and completion
brew "bash"
brew "bash-completion"
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "mobile-shell"

# Install vim
brew "vim"
brew "macvim"

# Install command line utilities
brew "ack"
brew "awscli"
brew "catimg"
brew "ccat"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "docker-completion"
brew "doitlive"
brew "elinks"
brew "fd"
brew "gist"
brew "git", args: ['without-completions']
brew "grc"
brew "gpg"
brew "gpg-agent"
brew "grep"
brew "htop-osx"
brew "httpie"
brew "httpstat"
brew "hub"
brew "iftop"
brew "ipcalc"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "ncdu"
brew "neofetch"
brew "openssl"
brew "pcre"
brew "pdfgrep"
brew "pv"
brew "python"
brew "readline"
brew "reattach-to-user-namespace"
brew "rename"
brew "shellcheck"
brew "ssh-copy-id"
brew "terminal-notifier"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "unrar"
brew "watch"
brew "wget"
brew "wifi-password"
brew "xz"
brew "youtube-dl"
brew "zplug"

# Install cask apps
cask '1password'
cask 'alfred'
cask 'appzapper'
cask 'atom'
cask 'bartender'
cask 'daisydisk'
cask 'day-o'
cask 'disk-inventory-x'
cask 'divvy'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iina'
cask 'iterm2'
cask 'karabiner'
cask 'keepingyouawake'
cask 'keycastr'
cask 'kindle'
cask 'macdown'
cask 'mactracker'
cask 'marked'
cask 'seil'
cask 'sip'
cask 'sonos'
cask 'sound-control'
cask 'spotify'
cask 'the-archive-browser'
cask 'the-unarchiver'
cask 'viscosity'
cask 'vlc'

# Install stuff from Mac App Store via mas
mas 'iStat Mini', id:927292435
mas 'Degrees Pro', id: 951510024
mas 'Copied', id: 1026349850
mas 'Pixelmator', id: 407963104
mas 'Tweetbot', id: 557168941
