#############################################
# Brewfile                                  #
# Install homebrew packages                 #
#############################################

# Usage:
# See https://docs.brew.sh/Brew-Bundle-and-Brewfile
# 
# > brew bundle


# Install some brew-related stuff
brew "brew-cask-completion"

# Install core shells and completion
brew "zsh"
brew "zoxide"
brew "zplug"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-fast-syntax-highlighting"

# Install vim
brew "vim"
brew "neovim"

# Install core command line utilities
brew "ack"
brew "awscli"
brew "bat"
brew "btop"
brew "coreutils"
brew "curl"
brew "delta"
brew "diff-so-fancy"
brew "doggo"
brew "eza"
brew "fd"
brew "fzf"
brew "gist"
brew "git"
brew "git-delta"
brew "gh"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "htop"
brew "httpie"
brew "inetutils"
brew "ipcalc"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "ncdu"
brew "nmap"
brew "prettyping"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sheldon"
brew "shellcheck"
brew "ssh-copy-id"
brew "starship"
brew "thefuck"
brew "tealdeer"
brew "tmux"
brew "tree"
#brew "urlview" #required for tmux-urlview plugin
brew "watch"
brew "wget"
brew "xz"
brew "yt-dlp"

# Work-specific CLI utilities
brew "ansible"
brew "aws-vault"
brew "helm"
brew "kubernetes-cli"
brew "kube-capacity"
brew "kubectx"
#brew "packer"
brew "ruby"
brew "tenv"
#brew "terraform"
brew "tflint"

tap "robscott/tap"
brew "robscott/tap/kube-capacity"

# Install cask apps
#cask '1password'
#cask '1password-cli'
#cask 'brave-browser'
#cask 'discord'
cask 'alacritty'
cask 'docker'
cask 'firefox'
#cask 'google-chrome'
#cask 'google-cloud-sdk'
cask 'iina'
cask 'imageoptim'
cask 'iterm2'
cask 'itsycal'
cask "jordanbaird-ice"
cask "json-viewer"
cask 'keepingyouawake'
#cask 'keybase'
#cask 'keycastr'
#cask 'kindle'
cask 'lens'
#cask 'marked'
#cask 'obsidian'
#cask 'overkill'
cask 'pika'
cask 'shottr'
#cask 'slack'
cask 'spotify'
cask 'steam'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vscodium'
#cask 'vlc'
#cask 'zoom'

# App Store Apps
# 1Password
# Be Focused Pro
# Bear
# Day One
# Deliveries
# ExifPurge
# Fantastical
# GarageBand
# Logic Pro
# Paprika Recipe Manager
# Pi Stats
# Pixelmator

# Other Apps to install
# Alfred.app
# Bartender


# Install additional shells and completion
brew "bash"
brew "bash-completion"

# Install optional command line utilities
brew "bandwhich"
#brew "bluetoothconnector"
#brew "doitlive"
#brew "fx"
#brew "gnupg"
brew "iftop"
#brew "python"
brew "wifi-password"

# Old Work-specific CLI utilities
#brew "aws-iam-authenticator"
#brew "blackbox"
#brew "brew-gem"
#brew "gem-rubocop"
#brew "minikube"
#brew "rbenv"
#brew "datawire/blackbird/telepresence"
#brew "datawire/blackbird/telepresence-arm64"
#brew "devnall/custom/terraform@0.12.18"
#brew "yarn"

# Old casks
# cask 'divvy'
