#############################################
# Brewfile                                  #
# Install homebrew packages                 #
#############################################

# Usage:
# See http://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
# To use the Brewfile, tap hombrew/bundle to install the command,
# then run it in a directory containing a brewfile.
# 
# > brew tap homebrew/bundle
# > brew bundle
#
# Or use the brewfile.sh wrapper


# Tap some repos
tap "homebrew/bundle"
tap "caskroom/cask"
tap "homebrew/core"

# Install some brew-related stuff
brew "brew-cask-completion"

# Install shells and completion
brew "bash"
brew "bash-completion"
brew "zsh"
brew "zplug"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-fast-syntax-highlighting"

# Install vim
brew "vim"
brew "neovim"

# Install command line utilities
brew "ack"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "bluetoothconnector"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "dog"
#brew "doitlive"
brew "fd"
brew "fzf"
brew "gist"
brew "git"
brew "github/gh/gh"
brew "gnu-tar"
brew "gnupg"
brew "grc"
brew "grep"
brew "gzip"
brew "htop"
brew "httpie"
brew "iftop"
brew "inetutils"
brew "ipcalc"
brew "jq"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "prettyping"
brew "python"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "ssh-copy-id"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "unrar"
brew "watch"
brew "wget"
brew "wifi-password"
brew "youtube-dl"

# Work-specific CLI utilities

brew "ansible"
brew "aws-iam-authenticator"
#brew "blackbox"
brew "brew-gem"
brew "gem-rubocop"
brew "helm"
brew "kubectx"
brew "kubernetes-cli"
brew "minikube"
brew "packer"
brew "rbenv"
brew "datawire/blackbird/telepresence"
brew "terraform"
brew "devnall/custom/terraform@0.12.18"
brew "terraform_landscape"
brew "tflint"
brew "yarn"


# Install cask apps
cask '1password'
cask 'alfred'
cask 'aws-vault'
cask 'bartender'
cask 'brave-browser'
cask 'divvy'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iina'
cask 'imageoptim'
cask 'iterm2'
cask 'itsycal'
cask 'keepingyouawake'
cask 'keybase'
cask 'keycastr'
cask 'kindle'
cask 'lens'
cask 'marked'
cask 'obsidian'
cask 'osxfuse'
cask 'overkill'
cask 'pika'
cask 'slack'
cask 'sound-control'
cask 'spotify'
cask 'steam'
cask 'the-archiver'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# App Store Apps
# 1Password
# Be Focused Pro
# Bear
# Dark Mode for Safari
# Day One
# Deliveries
# ExifPurge
# Fantastical
# GarageBand
# Logic Pro
# Paprika Recipe Manager
# Pi Stats
# Pixelmator
#
